Documents/ПередачаПодрядчику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаПодрядчику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИзделияУПодрядчикаПлан</xr:Item>
				<xr:Item>AccumulationRegister.ИзделияУПодрядчика</xr:Item>
				<xr:Item>AccumulationRegister.РасходыНаПодряд</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаемаяДатаВозврата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыНаПодряд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ИзделияУПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ИзделияУПодрядчика</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасходыНаПодряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасходыНаПодряд</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасходыНаПодряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИзделияУПодрядчикаПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИзделияУПодрядчикаПлан</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВозвратаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозвратаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПередачаПодрядчику/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ИзделияУПодрядчикаОстатки.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
	//	|	ИзделияУПодрядчикаОстатки.Подрядчик КАК Подрядчик
	//	|ИЗ
	//	|	РегистрНакопления.ИзделияУПодрядчика.Остатки(&МоментВремени, ИзделиеЗаказчика В (&ИзделияЗаказчика)) КАК ИзделияУПодрядчикаОстатки
	//	|ГДЕ
	//	|	ИзделияУПодрядчикаОстатки.КоличествоОстаток > 0";
	//
	//Запрос.УстановитьПараметр("ИзделияЗаказчика", ИзделияЗаказчика.ВыгрузитьКолонку("ИзделиеЗаказчика"));
	//Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
	//	Отказ = Истина;
	//	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
	//		стрОшибка = "Изделие "; 
	//	Иначе
	//		стрОшибка = "Изделия: "; 
	//	КонецЕсли;
	//	
	//	флПервоеИзделие = Истина;
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Если флПервоеИзделие Тогда
	//			флПервоеИзделие = НЕ флПервоеИзделие;
	//		Иначе
	//		    стрОшибка = стрОшибка + ", ";
	//		КонецЕсли;
	//		стрОшибка = стрОшибка + """" +ВыборкаДетальныеЗаписи.ИзделиеЗаказчика + """ у подрядчика " + ВыборкаДетальныеЗаписи.Подрядчик;
	//	КонецЦикла;
	//	Сообщить(стрОшибка,СтатусСообщения.Важное);
	//	Возврат;
	//КонецЕсли; 
	
	// регистр ИзделияУПодрядчика Приход
	Движения.ИзделияУПодрядчика.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.ИзделияУПодрядчика.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Подрядчик = Подрядчик;
		Движение.ИзделиеЭлемент = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент;
		Движение.Количество = 1;
	КонецЦикла;

	// регистр РасходыНаПодряд 
	Движения.РасходыНаПодряд.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.РасходыНаПодряд.Добавить();
		Движение.Период = Дата;
		Движение.Подрядчик = Подрядчик;
		Движение.Объект = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент.Проект;
		Движение.РасходыНаПодряд = ТекСтрокаИзделияЗаказчика.РасходыНаПодряд;
	КонецЦикла;

	
	
	// регистр ИзделияУПодрядчикаПлан 
	Движения.ИзделияУПодрядчикаПлан.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.ИзделияУПодрядчикаПлан.Добавить();
		Движение.Подрядчик = Подрядчик;
		Движение.ИзделиеЭлемент = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент;
		Движение.ДатаПередачи = Дата;
		Движение.ДатаВозвратаПлан = ТекСтрокаИзделияЗаказчика.ОжидаемаяДатаВозврата;
		
	КонецЦикла;

КонецПроцедуры
